Revit 2026 API

# DetailCurveArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DetailCurveArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
DetailCurveArrayIterator()
```
```fsharp
new : unit -> DetailCurveArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

DetailCurveArrayIterator Class

Autodesk.Revit.DB Namespace